Repository: Law4Hire/Law4Hire
Catalog: Law4Hire.Web/Resources/Components/Pages/Home.*.resx
Languages: es_es

# PageTitle
source: Welcome
es_es: Bienvenido

# WelcomeTitle
source: Start Your U.S. Immigration Journey
es_es: Comience Su Viaje de Inmigración a EE.UU.

# WelcomeSubtitle
source: Choose your path to achieving your American dream with expert legal guidance
es_es: Elija su camino para lograr su sueño americano con orientación legal experta

# VisitUSA
source: Visit or Tour the USA
es_es: Visitar o Conocer EE.UU.

# ApplyAsylum
source: Apply for Asylum
es_es: Solicitar Asilo

# JoinFamily
source: Join your Family
es_es: Reunirse con su Familia

# StudyUSA
source: Study in the USA
es_es: Estudiar en EE.UU.

# InvestUSA
source: Invest in the USA
es_es: Invertir en EE.UU.

# WorkUSA
source: Work in the USA
es_es: Trabajar en EE.UU.

# LoginAccount
source: Log in to your account
es_es: Iniciar sesión en su cuenta

source: Back to Options
es_es: Volver a las Opciones

source: Start Your Journey
es_es: Comience Su Viaje

source: Next
es_es: Siguiente

source: Previous
es_es: Anterior

source: Complete
es_es: Completar

# FirstNameQuestion
source: What is your first or given name?
es_es: ¿Cuál es su primer nombre o nombre de pila?

# LastNameQuestion
source: What is your last name or surname?
es_es: ¿Cuál es su apellido?

# MiddleNameQuestion
source: Do you have a middle name? (Optional)
es_es: ¿Tiene un segundo nombre? (Opcional)

# AddressQuestion
source: What is your current address?
es_es: ¿Cuál es su dirección actual?

# PhoneQuestion
source: What is your phone number?
es_es: ¿Cuál es su número de teléfono?

# EmailQuestion
source: What is your email address?
es_es: ¿Cuál es su dirección de correo electrónico?

# PasswordQuestion
source: Create a secure password
es_es: Cree una contraseña segura

# ExistingPasswordQuestion
source: Enter your password
es_es: Ingrese su contraseña

# FirstNamePlaceholder
source: Enter your first or given name
es_es: Ingrese su primer nombre

# LastNamePlaceholder
source: Enter your last name or surname
es_es: Ingrese su apellido

# MiddleNamePlaceholder
source: Enter your middle name (optional)
es_es: Ingrese su segundo nombre (opcional)

# AddressPlaceholder
source: Enter your full address
es_es: Ingrese su dirección completa

# PhonePlaceholder
source: Enter your phone number
es_es: Ingrese su número de teléfono

# EmailPlaceholder
source: Enter your email address
es_es: Ingrese su correo electrónico

# PasswordPlaceholder
source: Create a secure password
es_es: Cree una contraseña segura

# VisitDescription
source: Tourism, business visits, or temporary stays in the United States
es_es: Turismo, visitas de negocios o estadías temporales en Estados Unidos

# AsylumDescription
source: Seeking protection and safety in the United States
es_es: Buscando protección y seguridad en Estados Unidos

# FamilyDescription
source: Reuniting with family members who are U.S. citizens or residents
es_es: Reunirse con familiares que son ciudadanos o residentes de EE.UU.

# StudyDescription
source: Educational opportunities at American schools and universities
es_es: Oportunidades educativas en escuelas y universidades americanas

# InvestmentDescription
source: Business investment and entrepreneur opportunities
es_es: Oportunidades de inversión empresarial y emprendimiento

# WorkDescription
source: Employment-based immigration and work authorization
es_es: Inmigración basada en empleo y autorización de trabajo

# PasswordRequirements
source: Must contain at least one number, one uppercase, one lowercase, one special character, and at least 8 characters
es_es: Debe contener al menos un número, una mayúscula, una minúscula, un carácter especial y al menos 8 caracteres

# EmailExistsMessage
source: This email already exists. Please enter your password to log in.
es_es: Este correo electrónico ya existe. Por favor ingrese su contraseña para iniciar sesión.

source: Registration Complete!
es_es: ¡Registro Completado!

# WelcomeMessage
source: Welcome, {0}! Your account has been created successfully.
es_es: ¡Bienvenido, {0}! Su cuenta ha sido creada exitosamente.

source: Go to Dashboard
es_es: Ir al Panel de Control

# LoginError
source: Invalid email or password. Please try again.
es_es: Correo electrónico o contraseña inválidos. Por favor intente de nuevo.

# RegistrationError
source: Registration failed. Please try again.
es_es: El registro falló. Por favor intente de nuevo.

source: Please select...
es_es: Por favor seleccione...

# VisitPurposeQuestion
source: What is the primary purpose of your visit to the U.S.?
es_es: ¿Cuál es el propósito principal de su visita a los EE.UU.?

# VWPCountryQuestion
source: Are you a citizen of a Visa Waiver Program (VWP) country?
es_es: ¿Es usted ciudadano de un país del Programa de Exención de Visa (VWP)?

# USPaymentQuestion
source: Will you receive payment from a U.S. source during your trip?
es_es: ¿Recibirá pago de una fuente estadounidense durante su viaje?

# PurposeTourism
source: Tourism or vacation
es_es: Turismo o vacaciones

# PurposeVisitFamily
source: Visiting friends or family
es_es: Visitar amigos o familiares

# PurposeMedical
source: Medical treatment
es_es: Tratamiento médico

# PurposeBusiness
source: Business meetings or conferences
es_es: Reuniones de negocios o conferencias

# PurposeTransit
source: Transit to another country
es_es: Tránsito a otro país

# PurposeCrewMember
source: Working as a crew member (airline/ship)
es_es: Trabajar como miembro de tripulación (aerolínea/barco)

# PurposeOther
source: Other
es_es: Otro

source: Yes
es_es: Sí
